[AdvMEC_RC X2CharacterTemplate]
strCharacterName="Riot Control MEC"

[AdvMEC_RCM2 X2CharacterTemplate]
strCharacterName="Riot Control MEC MkII"

[RC_ADV_Bit X2CharacterTemplate]
strCharacterName="Security Bit"

[RC_ADV_Bit2 X2CharacterTemplate]
strCharacterName="Advanced Security Bit"

[SectopodMini X2CharacterTemplate]
strCharacterName="Sectopod Hunter"

[SectopodMini2 X2CharacterTemplate]
strCharacterName="Sectopod Hunter"

[SectopodRoyal X2CharacterTemplate]
strCharacterName="Sectopod Annihilator"

[AdvMEC_RC_WPN X2WeaponTemplate]
FriendlyName="Advent Mag Cannon"


[TaserPunch X2AbilityTemplate]
LocFriendlyName="Taser Punch"
LocLongDescription="Punch a target dealing light damage. Can Stun and Disoriente."
LocHelpText="Punch a target dealing light damage. Can Stun and Disoriente."
LocFlyOverText="Taser Punch."

[TaserPunch2 X2AbilityTemplate]
LocFriendlyName="Taser Punch"
LocLongDescription="Punch a target dealing light damage. Can Stun and Disoriente"
LocHelpText="Punch a target dealing light damage. Can Stun and Disoriente."
LocFlyOverText="Taser Punch."

[FlashBangMunitions X2AbilityTemplate]
LocFriendlyName="FlashBang Munitions"
LocLongDescription="The Riot Control MEC's shoulder mounted launcher can volley a salvo of Flashbangs that disorient those in the blast area."
LocHelpText="The Riot Control MEC's shoulder mounted launcher can volley a salvo of Flashbangs that disorient those in the blast area."

[AdvBitRepair X2AbilityTemplate]
LocFriendlyName="Repair"
LocLongDescription="The Security BIT can repair 4 HP on damaged robotic allies and weld 1 new armor in place. If there are no damaged allies, armor will still be added."
LocHelpText="The Security BIT can repair 4 HP on damaged robotic allies and weld 1 new armor in place. If there are no damaged allies, armor will still be added."

[AdvBitRepair2 X2AbilityTemplate]
LocFriendlyName="Advaced Repair"
LocLongDescription="The Advanced Security BIT will repair 6 HP on damaged robotic allies and weld 2 new armor in place. If there are no damaged allies, armor will still be added."
LocHelpText="The Advanced Security BIT will repair 6 HP on damaged robotic allies and weld 2 new armor in place. If there are no damaged allies, armor will still be added."

[RC_BITScanningProtocol X2AbilityTemplate]
LocFriendlyName="Search Protocol"
LocLongDescription="The Security BIT can trigger an instant scan of the area, increasing its own sight radius substantially for 2 turn, revealing any hidden or disguised enemies in view."
LocHelpText="The Security BIT can trigger an instant scan of the area, increasing its own sight radius substantially for 2 turn, revealing any hidden or disguised enemies in view."

[Hunter_Whiplash X2AbilityTemplate]
LocFriendlyName="Hunter Whiplash"
LocLongDescription="Attack an enemy with an electrical lash. Deals double damage to robotic units. Electrical attacks ignore armor."
LocHelpText="Attack an enemy with an electrical lash. Deals double damage to robotic units. Electrical attacks ignore armor."

[SectoKillZone X2AbilityTemplate]
LocFriendlyName="Kill Zone"
LocLongDescription="Take a reaction shot against any enemy that moves or attacks within a cone of fire."
LocHelpText="Enhanced squadsight overwatch. Take a reaction shot against any enemy that moves or attacks within a cone of fire."
LocFlyOverText="Kill Zone"

[SectopodImmunities X2AbilityTemplate]
LocFriendlyName="Sectopod Immunities"
LocLongDescription="The Sectopod is immune to fire, all poisons and mental attacks."
LocHelpText="The Sectopod is immune to fire, all poisons and mental attacks."


[SectoHelp X2AbilityTemplate]
LocFriendlyName="Robotic Reinforcements"
LocLongDescription="Calls in random robotic reinforcements."
LocHelpText="Calls in random robotic reinforcements."



[MRSabotageCC X2MissionTemplate]
DisplayName="Sabotage the ADVENT Monument and avoid security robots"
Briefing="Sabotage ADVENT Monument and avoid security robots"
PostMissionType="Sabotage the ADVENT Monument and avoid security robots"
BriefingImage="img:///UILibrary_Common.Xcom_default"
ObjectiveTextPools[0]="Neutralize all enemy forces"
ObjectiveTextPools[1]="Plant X4 on the monument"
PreMissionNarratives[0]="X2NarrativeMoments.TACTICAL.SabotageCC.T_SabotageCC_Narrative_Wrappers_01"
PreMissionNarratives[1]="X2NarrativeMoments.TACTICAL.SabotageCC.T_SabotageCC_Narrative_Wrappers_02"
PreMissionNarratives[2]="X2NarrativeMoments.TACTICAL.SabotageCC.T_SabotageCC_Narrative_Wrappers_03"
PreMissionNarratives[3]="X2NarrativeMoments.TACTICAL.SabotageCC.T_SabotageCC_Narrative_Wrappers_04"
PreMissionNarratives[4]="X2NarrativeMoments.TACTICAL.SabotageCC.T_SabotageCC_Narrative_Wrappers_05"

[MRSabotageCC X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="Rendezvous with Resistance Field Operative"
ObjectiveTextPools[1]="Neutralize all enemy targets"
ObjectiveTextPools[2]="Plant X4 charges on the monument"



[MRCompoundRescueOperative X2MissionTemplate]
DisplayName="Rescue Operative from ADVENT Compound and avoid security robots"
Briefing="Rescue Operative from ADVENT Compound and avoid security robots"
PostMissionType="Rescue Operative from ADVENT Compound and avoid security robots"
BriefingImage="img:///UILibrary_Common.Xcom_default"
ObjectiveTextPools[0]="Rescue Operative from ADVENT custody"
PreMissionNarratives[0]="XPACK_NarrativeMoments.X2_XP_CEN_T_Compound_Rescue_Dropship_Intro_A"
PreMissionNarratives[1]="XPACK_NarrativeMoments.X2_XP_CEN_T_Compound_Rescue_Dropship_Intro_B"
PreMissionNarratives[2]="XPACK_NarrativeMoments.X2_XP_CEN_T_Compound_Rescue_Dropship_Intro_C"

[MRCompoundRescueOperative X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="Turns until Skyranger must retreat"
ObjectiveTextPools[1]="Rescue XCOM Operative from ADVENT Compound"
ObjectiveTextPools[2]="Extract the rescued operative"
ObjectiveTextPools[3]="Extract all XCOM soldiers"



[MRRescueAdventCell X2MissionTemplate]
DisplayName="Rescue VIP from ADVENT Cell and avoid security robots"
Briefing="Rescue VIP from ADVENT Cell and avoid security robots"
PostMissionType="Extract VIP"
BriefingImage="img:///UILibrary_Common.Xcom_default"
ObjectiveTextPools[0]="Rescue VIP from ADVENT custody"
PreMissionNarratives[0]="X2NarrativeMoments.TACTICAL.RescueVIP.Central_Council_Missions_Rescue_VIP_01"
PreMissionNarratives[1]="X2NarrativeMoments.TACTICAL.RescueVIP.Central_Council_Missions_Rescue_VIP_02"
PreMissionNarratives[2]="X2NarrativeMoments.TACTICAL.RescueVIP.Central_Council_Missions_Rescue_VIP_03"
PreMissionNarratives[3]="X2NarrativeMoments.TACTICAL.RescueVIP.Central_Council_Missions_Rescue_VIP_04"
PreMissionNarratives[4]="X2NarrativeMoments.TACTICAL.RescueVIP.Central_Council_Missions_Rescue_VIP_05"

[MRRescueAdventCell X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="Turns until Skyranger must retreat"
ObjectiveTextPools[1]="Rescue VIP from ADVENT Prison"
ObjectiveTextPools[2]="Extract the VIP at designated location"
ObjectiveTextPools[3]="Extract all XCOM soldiers"


[MRRescueVehicle X2MissionTemplate]
DisplayName="Rescue VIP from ADVENT Vehicle and avoid security robots"
Briefing="Rescue VIP from ADVENT Vehicle and avoid security robots"
PostMissionType="Extract VIP"
BriefingImage="img:///UILibrary_Common.Xcom_default"
ObjectiveTextPools[0]="Rescue VIP from ADVENT custody"
PreMissionNarratives[0]="X2NarrativeMoments.TACTICAL.RescueVIP.Central_Council_Missions_Rescue_VIP_Vehicle_01"
PreMissionNarratives[1]="X2NarrativeMoments.TACTICAL.RescueVIP.Central_Council_Missions_Rescue_VIP_Vehicle_02"
PreMissionNarratives[2]="X2NarrativeMoments.TACTICAL.RescueVIP.Central_Council_Missions_Rescue_VIP_Vehicle_03"
PreMissionNarratives[3]="X2NarrativeMoments.TACTICAL.RescueVIP.Central_Council_Missions_Rescue_VIP_Vehicle_04"
PreMissionNarratives[4]="X2NarrativeMoments.TACTICAL.RescueVIP.Central_Council_Missions_Rescue_VIP_Vehicle_05"


[MRRescueVehicle X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="Turns until Skyranger must retreat"
ObjectiveTextPools[1]="Rescue VIP from ADVENT Vehicle"
ObjectiveTextPools[2]="Extract the VIP at designated location"
ObjectiveTextPools[3]="Extract all XCOM soldiers"



[MRExtract X2MissionTemplate]
DisplayName="Extract VIP from ADVENT City and avoid security robots"
Briefing="Extract VIP from ADVENT City and avoid security robots"
PostMissionType="Extract VIP"
BriefingImage="img:///UILibrary_Common.Xcom_default"
ObjectiveTextPools[0]="Deliver VIP to extraction point"
PreMissionNarratives[0]="X2NarrativeMoments.TACTICAL.Extract.Central_Council_Missions_Extract_VIP_01"
PreMissionNarratives[1]="X2NarrativeMoments.TACTICAL.Extract.Central_Council_Missions_Extract_VIP_02"
PreMissionNarratives[2]="X2NarrativeMoments.TACTICAL.Extract.Central_Council_Missions_Extract_VIP_03"
PreMissionNarratives[3]="X2NarrativeMoments.TACTICAL.Extract.Central_Council_Missions_Extract_VIP_04"
PreMissionNarratives[4]="X2NarrativeMoments.TACTICAL.Extract.Central_Council_Missions_Extract_VIP_05"

[MRExtract X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="Turns until Skyranger must retreat"
ObjectiveTextPools[1]="Extract the VIP at designated location"
ObjectiveTextPools[2]="Extract all XCOM soldiers"


[MRSupplyExtraction X2MissionTemplate]
DisplayName="Avoid automated defenses and extract ADVENT supplies"
Briefing="ADVENT has supplies in the area. Recon reports suggest there are far less ADVENT but a larger than normal Automated Defense. Probably put in place to guard the supplies."
PostMissionType="Avoid automated defenses and extract ADVENT supplies"
BriefingImage="img:///UILibrary_Common.Xcom_default"
ObjectiveTextPools[0]="Secure and extract ADVENT supplies"
ObjectiveTextPools[1]="Neutralize all enemy targets"
PreMissionNarratives[0]="XPACK_NarrativeMoments.X2_XP_CEN_T_Extract_Supplies_Dropship_Intro_A"
PreMissionNarratives[1]="XPACK_NarrativeMoments.X2_XP_CEN_T_Extract_Supplies_Dropship_Intro_B"
PreMissionNarratives[2]="XPACK_NarrativeMoments.X2_XP_CEN_T_Extract_Supplies_Dropship_Intro_C"

[MRSupplyExtraction X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="Mark and recover ADVENT crates"
ObjectiveTextPools[1]="Neutralize all enemy targets"
ObjectiveTextPools[2]="Extract all XCOM soldiers"
ObjectiveTextPools[3]="OR: Eliminate all remaining hostile targets"


[MRSabotageAlienFacility X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="Plant X4 to Destroy Sectopod Testing Facility"
ObjectiveTextPools[1]="Extract all XCOM soldiers"
ObjectiveTextPools[2]="Call in the skyranger and extract all soldiers to complete this mission."
ObjectiveTextPools[3]="Blade test 2"
ObjectiveTextPools[4]="Blade test 3"


[MRSabotageAlienFacility X2MissionTemplate]
DisplayName="Sabotage the Sectopod Testing Facility"
Briefing="Sabotage Sectopod Testing Facility"
PostMissionType="Sabotage Sectopod Testing Facility"
BriefingImage="img:///UILibrary_StrategyImages.X2StrategyMap.Alert_Advent_Facility"
ObjectiveTextPools[0]="Place X4 charges in Sectopod Testing facility"
ObjectiveTextPools[1]="Escape the Area of Operations"
PreMissionNarratives[0]="X2NarrativeMoments.TACTICAL.Sabotage.T_Sabotage_Narrative_Wrappers_01"
PreMissionNarratives[1]="X2NarrativeMoments.TACTICAL.Sabotage.T_Sabotage_Narrative_Wrappers_02"
PreMissionNarratives[2]="X2NarrativeMoments.TACTICAL.Sabotage.T_Sabotage_Narrative_Wrappers_03"
PreMissionNarratives[3]="X2NarrativeMoments.TACTICAL.Sabotage.T_Sabotage_Narrative_Wrappers_04"
PreMissionNarratives[4]="X2NarrativeMoments.TACTICAL.Sabotage.T_Sabotage_Narrative_Wrappers_05"


